{
  "backend/main.mo": "Motoko actor with access control, blob storage mixins, media list, love letter text, and user profile management plus admin-gated love letter saving.",
  "backend/migration.mo": "Migration resets the loveLetter field to an empty string while preserving other fields.",
  "feature_evidence.json": "Feature evidence report listing two ValentineMessage-related frontend features with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their functionality, styling, components, and behaviors.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/PREVIEW_VERIFICATION_V21.md": "Checklist for verifying Version 21 preview including flow, content, and gallery tests before production promotion.",
  "frontend/PRODUCTION_PROMOTION_V25.md": "Record of Version 25 promotion to production with no code changes, outlining verification and release mode behavior.",
  "frontend/PRODUCTION_PROMOTION.md": "Guide detailing steps and verification required to promote a preview version to production deployment.",
  "frontend/PRODUCTION_SMOKE_TEST_RESULTS_V21.md": "Template for logging Version 21 production smoke test results across devices, browsers, and core features.",
  "frontend/PRODUCTION_SMOKE_TEST_RESULTS_V25.md": "Template for documenting version 25 production smoke test results, including browser/device checks and the full Valentine flow verification.",
  "frontend/PRODUCTION_SMOKE_TEST.md": "Production smoke test checklist covering full Valentine flow, gallery, lightbox, animations, and error checks.",
  "frontend/src/App.tsx": "Main app component controlling page flow between welcome, quiz, and memories, with providers and release mode initialization.",
  "frontend/src/components/FloatingHearts.tsx": "Generates animated floating heart icons with randomized positions and timing.",
  "frontend/src/components/FloatingPetals.tsx": "Displays animated falling flower petals using randomized positions and delays.",
  "frontend/src/components/LocalMemoriesPicker.tsx": "Component for selecting, previewing, and managing local or preloaded images with lightbox support and error handling.",
  "frontend/src/components/MediaGallery.tsx": "Empty placeholder component for a media gallery.",
  "frontend/src/components/MediaUpload.tsx": "Empty placeholder component for uploading media.",
  "frontend/src/components/MemoryLightbox.tsx": "Lightbox dialog for viewing a full-size memory image with close controls.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing an authenticated or anonymous backend actor, refreshing queries when identity changes.",
  "frontend/src/hooks/useBackgroundMusic.ts": "Hook that initializes looping background music and exposes a start function.",
  "frontend/src/hooks/useInternetIdentity.ts": "Large hook and provider managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating love letters and media via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive light/dark Valentine-themed CSS variables plus global base styles.",
  "frontend/src/lib/queryClient.ts": "Creates a configured React Query client with default stale time and window focus behavior.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CustomizeMessage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/ValentineMessage.tsx": "Displays, edits, and saves a love letter with authentication, UI controls, and themed visuals.",
  "frontend/src/pages/ValentineQuestion.tsx": "Empty placeholder page component.",
  "frontend/src/pages/ValentineQuiz.tsx": "Interactive multi-question Valentine quiz with animated heart effects and completion callback.",
  "frontend/src/pages/ValentineWelcome.tsx": "Renders animated themed welcome screen that starts background music and triggers start action.",
  "frontend/src/utils/releaseMode.ts": "Removes preview URL artifacts and initializes clean release mode behavior.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and cleaning URL parameters, supporting hash and query modes.",
  "frontend/src/valentine/loveLetter.ts": "Stores the default preset love letter text.",
  "frontend/src/valentine/preloadedMemories.ts": "Exports an array of default memory image paths.",
  "frontend/src/valentine/quizData.ts": "Defines Valentine quiz questions with options and correct answers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, dark mode, extended colors, animations, and plugins.",
  "project_state.json": "Project state metadata capturing version info, architectural notes, known issues, and existing feature definitions."
}