{
  "backend/main.mo": "Motoko canister handling user profiles, access control, Valentine message ownership, media upload, and public media retrieval with owner-gated modifications.",
  "feature_evidence.json": "Feature evidence report linking features to affected files, components, and test IDs with high‑confidence metadata.",
  "frontend-file-summaries.txt": "Compiled summaries describing responsibilities and changes across various frontend components and pages.",
  "frontend/index.css": "Empty file placeholder for global styles.",
  "frontend/index.html": "HTML entry point that loads the React app via main.tsx into a root div.",
  "frontend/PRODUCTION_PROMOTION.md": "Guide outlining steps to verify, prepare, and build a preview version before promoting it to production.",
  "frontend/PRODUCTION_SMOKE_TEST.md": "Checklist for validating core Valentine experience in production, covering flow, gallery, lightbox, and visual checks.",
  "frontend/src/App.tsx": "Main React component orchestrating welcome → quiz → memories flow and initializing release mode within providers.",
  "frontend/src/components/FloatingHearts.tsx": "Animated component generating floating heart elements with randomized positions and timing.",
  "frontend/src/components/FloatingPetals.tsx": "Animated component rendering falling petals with randomized positions and durations.",
  "frontend/src/components/LocalMemoriesPicker.tsx": "Component allowing users to load, preview, lightbox-view, and remove local or preloaded images with validation and error handling.",
  "frontend/src/components/MediaGallery.tsx": "Displays images and videos with error handling, deletion, downloads, and a lightbox viewer.",
  "frontend/src/components/MediaUpload.tsx": "Handles authenticated media uploads with validation, previews, and progress tracking.",
  "frontend/src/components/MemoryLightbox.tsx": "Presents a modal lightbox to view a full-size image with a close button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useBackgroundMusic.ts": "Initializes and plays looping background audio with simple start control.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, identity management, and an authentication context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating love letters and media via the backend actor.",
  "frontend/src/index.css": "Tailwind-based global styles defining a Valentine-themed light/dark color palette and typography rules.",
  "frontend/src/lib/queryClient.ts": "Exports a preconfigured React Query client with default stale time and focus behavior settings.",
  "frontend/src/main.tsx": "Bootstraps the app with QueryClientProvider and InternetIdentityProvider and renders the root component.",
  "frontend/src/pages/CustomizeMessage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/ValentineMessage.tsx": "Displays a love letter with fallback content and an optional memories gallery toggle.",
  "frontend/src/pages/ValentineQuestion.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/pages/ValentineQuiz.tsx": "Interactive quiz component that advances through questions and triggers a completion callback.",
  "frontend/src/pages/ValentineWelcome.tsx": "Welcome screen that starts background music and transitions to the next step.",
  "frontend/src/utils/releaseMode.ts": "Cleans preview-related URL parameters and initializes sanitized release mode.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/src/valentine/loveLetter.ts": "Exports the default love letter text used as a fallback.",
  "frontend/src/valentine/preloadedMemories.ts": "Provides a list of default image paths for the memories feature.",
  "frontend/src/valentine/quizData.ts": "Defines the quiz question objects and answer keys.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom valentine theme colors and animations.",
  "project_state.json": "Tracks project version, features, architectural notes, and known issues for a Valentine-themed interactive quiz site. Contains state metadata plus lists of existing features, outstanding problems, and user-approved version info."
}