{
  "backend/main.mo": "Motoko canister managing user profiles, love letter template, owner-gated media upload, and public media viewing with integrated access control.",
  "feature_evidence.json": "Feature evidence report linking production promotion and smoke‑test features to their related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose and behavior of each frontend file in the project.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "HTML entry point setting up root element and loading the main TypeScript module.",
  "frontend/PRODUCTION_PROMOTION_V25.md": "Record of promoting Version 25 preview to production with no code changes, including verification steps and release mode notes.",
  "frontend/PRODUCTION_PROMOTION.md": "Guide explaining how to promote an approved preview build to production, including verification and build steps.",
  "frontend/PRODUCTION_SMOKE_TEST_RESULTS_V25.md": "Template for recording smoke test results for Version 25 across devices and sections of the Valentine flow.",
  "frontend/PRODUCTION_SMOKE_TEST.md": "Checklist for validating the full Valentine flow and UI behavior in production after deployment.",
  "frontend/src/App.tsx": "Root React component initializing release mode and managing navigation between welcome, quiz, and memories pages with providers.",
  "frontend/src/components/FloatingHearts.tsx": "Renders floating animated heart icons with randomized positions and timings.",
  "frontend/src/components/FloatingPetals.tsx": "Displays falling petal images with randomized animation settings.",
  "frontend/src/components/LocalMemoriesPicker.tsx": "Allows users to select, preview, remove, and view local or preloaded images with lightbox support.",
  "frontend/src/components/MediaGallery.tsx": "Shows a gallery of uploaded media with deletion, error handling, lightbox, and video preview logic.",
  "frontend/src/components/MediaUpload.tsx": "Handles authenticated media uploads with validation, previews, progress tracking, and error handling.",
  "frontend/src/components/MemoryLightbox.tsx": "Provides a modal lightbox for displaying a single image with a close button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on authentication state and refreshes dependent queries.",
  "frontend/src/hooks/useBackgroundMusic.ts": "Initializes and controls looping background music playback.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, and identity loading logic.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating love letters and media items via an actor API.",
  "frontend/src/index.css": "Configures Tailwind styles and custom Valentine-themed CSS variables, base styles, and utilities.",
  "frontend/src/lib/queryClient.ts": "Creates a configured React QueryClient with default stale times and disabled refetch-on-focus.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CustomizeMessage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/ValentineMessage.tsx": "Displays the love letter with fallback logic and optionally shows a memories picker with animations.",
  "frontend/src/pages/ValentineQuestion.tsx": "Empty placeholder page component.",
  "frontend/src/pages/ValentineQuiz.tsx": "Implements an animated multiple‑choice Valentine quiz that advances on correct answers and triggers a completion callback.",
  "frontend/src/pages/ValentineWelcome.tsx": "Shows an animated Valentine-themed welcome screen and starts background music before beginning the experience.",
  "frontend/src/utils/releaseMode.ts": "Provides utilities to remove preview URL artifacts and initialize clean release mode behavior.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/valentine/loveLetter.ts": "Exports the default love letter string used as fallback content.",
  "frontend/src/valentine/preloadedMemories.ts": "Defines the list of default memory image paths for the memories viewer.",
  "frontend/src/valentine/quizData.ts": "Defines the QuizQuestion interface and provides an array of Valentine‑themed multiple‑choice quiz questions with correct answer indices.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores the project’s current state, feature list, known issues, and notes for the Valentine quiz website."
}