{
  "backend/main.mo": "Actor implementing blob storage, authorization, user profiles, media items, and a love letter template with owner initialization and access controls.",
  "backend/migration.mo": "Migration module fixing old deployments by replacing an outdated love letter template with the corrected one if needed.",
  "feature_evidence.json": "Placeholder feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Stores prewritten summaries for multiple frontend source files and components.",
  "frontend/index.css": "Empty stylesheet file.",
  "frontend/index.html": "Basic HTML entry file loading the client application via main.tsx.",
  "frontend/PRODUCTION_PROMOTION_V25.md": "Record of promoting Version 25 to production with no code changes, including verification steps and release mode notes.",
  "frontend/PRODUCTION_PROMOTION.md": "Guide explaining the steps required to promote a preview build to production, including verification and build preparation.",
  "frontend/PRODUCTION_SMOKE_TEST_RESULTS_V25.md": "Template for recording smoke test results for Version 25 using the production checklist.",
  "frontend/PRODUCTION_SMOKE_TEST.md": "Checklist for validating core functionality of the production deployment across welcome, quiz, memories, gallery, and animations.",
  "frontend/src/App.tsx": "Main app component managing page navigation and initializing theme, identity, and query client.",
  "frontend/src/components/FloatingHearts.tsx": "Renders animated floating heart icons with randomized positions and timings.",
  "frontend/src/components/FloatingPetals.tsx": "Displays animated falling petal images using randomized positions and durations.",
  "frontend/src/components/LocalMemoriesPicker.tsx": "Lets users add, preview, remove, and view local or preloaded images with lightbox support.",
  "frontend/src/components/MediaGallery.tsx": "Shows uploaded media items with delete, download, preview, and error handling for images and videos.",
  "frontend/src/components/MediaUpload.tsx": "Handles authenticated image/video upload with validation, preview, progress tracking, and error messages.",
  "frontend/src/components/MemoryLightbox.tsx": "Simple modal for viewing a single image at full size with a close button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching queries when identity changes.",
  "frontend/src/hooks/useBackgroundMusic.ts": "Initializes and controls background audio playback for a looping MP3 file.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, identity persistence, and state tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating love letters and media via the actor API with cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive Valentine-themed light/dark color variables plus base styling rules.",
  "frontend/src/lib/queryClient.ts": "Creates a configured QueryClient with default stale time and focus refetch settings.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CustomizeMessage.tsx": "Empty placeholder file for a message customization page.",
  "frontend/src/pages/ValentineMessage.tsx": "Displays the love letter with fallback handling and an optional memories section with animations.",
  "frontend/src/pages/ValentineQuestion.tsx": "Empty placeholder page for a question flow.",
  "frontend/src/pages/ValentineQuiz.tsx": "Renders a multi‑question Valentine quiz with animated heart effects and completion callback.",
  "frontend/src/pages/ValentineWelcome.tsx": "Shows the animated Valentine welcome screen with floating hearts and a start button that triggers music.",
  "frontend/src/utils/releaseMode.ts": "Utilities to sanitize preview URL artifacts and initialize clean release mode on load.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/valentine/loveLetter.ts": "Exports the default Valentine love letter text.",
  "frontend/src/valentine/preloadedMemories.ts": "Provides a list of default photo asset paths for the memories feature.",
  "frontend/src/valentine/quizData.ts": "Defines a QuizQuestion interface and provides an array of Valentine-themed quiz questions with options and correct answer indexes.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project state, including issues, architectural notes, and feature history for fixing the Valentine app’s rendering and content problems."
}