{
  "kind": "build_request",
  "title": "Clear the default love letter and let the user write it on the website",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-45",
      "text": "Update the final “My Love Letter” page so the displayed letter is NOT automatically filled with `defaultLoveLetter` when the backend love letter is empty/blank; if the backend love letter is empty/whitespace-only, show an empty letter state with a clear prompt to write a letter instead.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Can you earase the letter and let me weite it on the website"
        ]
      },
      "acceptanceCriteria": [
        "If `getLoveLetter()` returns an empty string or whitespace, the page does not render the prewritten `defaultLoveLetter` content.",
        "When the letter is empty, the UI shows an English prompt indicating the user can write the letter on the website (e.g., an empty state message and/or textarea placeholder).",
        "The letter rendering continues to preserve user formatting (line breaks) for non-empty letters (e.g., `whitespace-pre-wrap`)."
      ]
    },
    {
      "id": "REQ-46",
      "text": "Change the love letter editing behavior on the final “My Love Letter” page so that starting an edit can begin from a blank textarea (not pre-populated with any prewritten template). Add a clear, explicit control to clear/erase the current letter content while editing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Can you earase the letter and let me weite it on the website"
        ]
      },
      "acceptanceCriteria": [
        "Entering edit mode does not automatically insert the prewritten template text into the textarea.",
        "There is a visible control in edit mode (English label) that clears the textarea content to empty in one action.",
        "The existing Save and Cancel behaviors still work after clearing the textarea (Save persists what’s currently in the textarea; Cancel abandons edits)."
      ]
    },
    {
      "id": "REQ-47",
      "text": "Initialize the backend stored love letter value as empty (no prewritten default letter) so a fresh deployment starts with no letter content until the user writes and saves it via the website.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Can you earase the letter and let me weite it on the website"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh canister install, `getLoveLetter()` returns an empty string (or clearly empty/whitespace-only value), not the current prewritten Marianne/Nikita letter.",
        "Saving a new letter via the existing `saveLoveLetter(newLoveLetter)` continues to persist and is returned by `getLoveLetter()` thereafter."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything under frontend/src/components/ui (compose instead).",
    "Backend must remain a single Motoko actor with all logic in backend/main.mo; add backend/migration.mo only if required by the conditional migration policy."
  ],
  "nonGoals": [
    "Do not change the quiz flow, welcome screen content, background music behavior, or memories photo picker/lightbox features.",
    "Do not add any third-party authentication or external database/storage beyond the existing canister state and Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}