{
  "kind": "build_request",
  "title": "Restore exact user-provided love letter by updating backend default template and conditional upgrade migration",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-35",
      "text": "Update the backend default stored love letter template (`loveLetterTemplate` in `backend/main.mo`) so that `getLoveLetter()` returns exactly the same love letter text as `frontend/src/valentine/loveLetter.ts` exports in `defaultLoveLetter`, preserving all characters exactly (line breaks, punctuation, apostrophes, the em dash (—), and the ❤️ emoji).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "You did not change the letter bro"
        ]
      },
      "acceptanceCriteria": [
        "A fresh deploy (no existing state) returns a `getLoveLetter()` value that matches `frontend/src/valentine/loveLetter.ts` `defaultLoveLetter` byte-for-byte (including newlines, the em dash (—), and the ❤️ emoji).",
        "The returned text begins with \"Wania,\" and ends with \"Shabab ❤️\" with the same line breaks as the frontend default."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Add/restore conditional upgrade migration logic (per the project’s conditional migration policy) so that when upgrading an existing deployed canister, the love letter is corrected only if the stored love letter still equals the currently-wrong default backend template (the current Nikita/family letter), and the migration must not overwrite an already-customized love letter that may have been intentionally set via `updateLoveLetter()`.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "You did not change the letter bro"
        ]
      },
      "acceptanceCriteria": [
        "On upgrade, if the stored love letter exactly equals the previously-shipped wrong default backend template string, it is replaced with the correct `defaultLoveLetter` text.",
        "On upgrade, if the stored love letter differs from the previously-shipped wrong default backend template string (meaning it was customized), it remains unchanged.",
        "After upgrade, `getLoveLetter()` returns the corrected letter for the default/wrong-template case."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Ensure the final love letter UI is using the backend value when present, but displays the exact `defaultLoveLetter` text when the backend value is missing/empty/whitespace-only or the query fails, without altering the user’s letter formatting (keep `whitespace-pre-wrap` rendering so line breaks appear exactly as written).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "You did not change the letter bro"
        ]
      },
      "acceptanceCriteria": [
        "If the backend returns the correct letter, the UI displays it with the same line breaks as stored.",
        "If the backend returns an empty/whitespace-only string or fails to load, the UI displays the `defaultLoveLetter` text from `frontend/src/valentine/loveLetter.ts` with all line breaks preserved.",
        "No part of the letter text is auto-hyphenated or reformatted in a way that changes the letter’s content."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic in `backend/main.mo`.",
    "Only add `backend/migration.mo` if required for upgrading existing state; follow the conditional migration policy to avoid overwriting customized state.",
    "Do not edit files under `frontend/src/components/ui` or other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not change quiz questions, welcome screen, memories gallery behavior, or media upload features.",
    "Do not add new authentication methods beyond Internet Identity.",
    "Do not introduce new backend services or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}